app/views/trips/new.html.erb

SELECT "categories".* FROM "categories"
---
  <h3>Select Category</h3>
  <%= f.collection_check_boxes :category_id, Category.all, :id, :name %>