app/views/trips/show.html.erb


  <% @trip.items.each do |item| %>
---
SELECT "items".* FROM "items" INNER JOIN "trip_items" ON "items"."trip_item_id" = "trip_items"."id" WHERE "trip_items"."trip_id" = ?  [["trip_id", 3]]

  <%= f.hidden_field :trip_id %>
  <%= f.collection_check_boxes :item_id, @trip.category.items.all.uniq, :id, :name %>
---
SELECT DISTINCT "items".* FROM "items" INNER JOIN "trip_items" ON "items"."id" = "trip_items"."item_id" INNER JOIN "trips" ON "trip_items"."trip_id" = "trips"."id" WHERE "trips"."category_id" = ?  [["category_id", 1]]