app/views/welcome/home.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 1]]
---
  <h3>List of Trips</h3>
  <% current_user.trips.each do |trip| %>

SELECT "categories".* FROM "categories" INNER JOIN "trips" ON "categories"."id" = "trips"."category_id" WHERE "trips"."user_id" = ?  [["user_id", 1]]
---
  <h3>Trips by Category</h3>
  <% current_user.categories.uniq.each do |category| %>