app/controllers/items_controller.rb

  def create
    @item = Item.create(item_params)
---
INSERT INTO "items" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-08-11 21:47:59.623950"], ["updated_at", "2017-08-11 21:47:59.623950"]]