app/controllers/trips_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Beach"]]
SELECT  "trips".* FROM "trips" WHERE "trips"."name" = ? LIMIT 1  [["name", "March Break 2017"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 7]]
---
  def create
    binding.pry
    @trip = Trip.create(trip_params)
    if params[:trip][:category_id].nil? || params[:trip][:category_id] == ""
      @trip.category = Category.find_or_create_by(name: params[:trip][:categories][:name])
    else
      @trip.category = Category.find(params[:trip][:category_id][0])