app/controllers/trips_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @trip = Trip.new
    @categories = Category.all

INSERT INTO "trips" ("title", "destination", "year", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Spring Break"], ["destination", "Florida"], ["year", 2016], ["notes", "To do:\r\nFeed Cat"], ["created_at", "2017-08-11 13:30:47.551592"], ["updated_at", "2017-08-11 13:30:47.551592"]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Beach"], ["created_at", "2017-08-10 21:53:52.946073"], ["updated_at", "2017-08-10 21:53:52.946073"]]
UPDATE "trips" SET "category_id" = ?, "user_id" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["category_id", 1], ["user_id", 1], ["updated_at", "2017-08-11 15:43:47.037321"], ["id", 3]]
SELECT "categories".* FROM "categories"
---
  def create
    @trip = Trip.create(trip_params)
    @trip.add_category(params[:trip][:category_id], params[:trip][:categories][:name])
    if @trip.category
      @trip.save
      current_user.trips << @trip
      redirect_to trip_path(@trip)
    else
      @categories = Category.all

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @trip = Trip.find(params[:id])