app/controllers/trip_items_controller.rb

INSERT INTO "trip_items" ("trip_id", "quantity", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["trip_id", 1], ["quantity", 1], ["item_id", 2], ["created_at", "2017-08-11 23:19:12.982297"], ["updated_at", "2017-08-11 23:19:12.982297"]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 3]]
---
  def create
    if params[:trip_item][:item_id][0].nil? || params[:trip_item][:item_id][0] == ""
      trip_item = TripItem.create(trip_item_params)
    else
      trip_item = TripItem.create(trip_id: params[:trip_item][:trip_id], item_id: params[:trip_item][:item_id][0], quantity: params[:trip_item][:quantity])
    end
    @trip = Trip.find(trip_item.trip_id)