app/controllers/welcome_controller.rb

  def home
    @trips = Trip.all
---
SELECT "trips".* FROM "trips"