app/views/categories/show.html.erb

<ul>
  <% @category.trips.each do |trip| %>
---
SELECT "trips".* FROM "trips" WHERE "trips"."category_id" = ?  [["category_id", 7]]